{"id":"21","title":"Javascript - Tipos Primitivos e Revelações","by":"Rodrigo Vidal","tags":["JavaScript"],"category":"JavaScript","date":"'2012-01-23'","deploy":"true","content":"\nOlá pessoal, tudo bem?\n\nVamos falar hoje sobre sobre a linguagem mandatória para escrever aplicações web. O Javascript. E quem não tem medo do Javascript? Até hoje vejo que muitos desenvolvedores não deram e ainda não dão importância, para esta linguagem. A maioria se limita a criar funções simples com outras funções logo abaixo em um código que beira o impossível de manter. Ou então se limita ao simples uso de plugins jQuery desenvolvidos por terceiros, para colocar uma calendário mais bonitinho na aplicação. Bom, já passou da hora de você saber que javascript é extremamente importante, e você deveria domina-la tanto quanto a linguagem server-side de preferência. Eu realmente espero que você domine está ultima. \n\nNão pretendo aqui contar a historia do JavaScript, ou justificar, a razão de ela possuir alguns problemas comportamentais, o importante é que você aprenda a escrever um bom código e tenha produtividade, sem esbarrar em bugs inesperados.\n\nBom, precisamos mudar isso, portanto, vamos ver hoje os tipos primitivos.\n\nQualquer valor que você use pertence a um tipo. Em javascript existem os seguintes tipos primitivos:\n\n**Number**  - incluir números inteiros bem como de ponto flutuante.\n\n**String** - qualquer numero de caracteres, por exemplo \"a\", \"ab\", \"ab e c\".\n\n**Boolean** - assume apenas dois valores, true, ou false.\n\n**Undefined** - quando você tenta acessar uma variável que não existe, você recebe o valor especial undefined. O mesmo acontece para uma variável que ainda não foi inicializada. O javascript na verdade a inicializa para undefined por debaixo dos panos.\n\n**Null** - este é outro tipo especial que somente possui um valor, o valor null. Que significa, ausência de valor, vazio, ou nada. A diferença com undefined é que se uma variável tem o valor null, ela está definida, e só acontece quando é definida para null.\n\nQualquer valor que não pertença a nenhum dos 5 tipos primitivos listados acima é do tipo Object. \nEntão basta lembrarmos que em Javascript o tipo dos dados pode ser:\n\nPrimitivo (os 5 listados acima)\nNão-Primitivo (object)\n\n###O operador typeof\n\nSe você quer saber o tipo de uma variável ou de um valor, você pode utilizar o operador typeof. Este operador retorna uma string que representa o tipo do dado. Por exemplo o operador pode retornar \"number\", \"string\", \"boolean\", \"undefined\", \"object\". Vejamos alguns exemplos:\n\n###Números\n\n<pre><code>\n//Inteiro\nvar n = 1234;\ntypeof n;\n>> \"number\"\n \n//Ponto Flutuante\nvar n = 1.23;\ntypeof n;\n>> \"number\"\n \n//Octal\nvar n = 0377;\ntypeof n;\n>> \"number\"\n \n//Hexa\nvar n = 0x00;\ntypeof n;\n>> \"number\"\n \n//Exponent\nvar n = 1e1;\ntypeof n;\n>> \"number\"\n</code></pre>\n\nExistem um valor especial em JavaScript chamado Infinity, veja bem, é um valor especial e não um tipo. Que representa como o próprio nome diz um valor Infinito, ou um valor que o JavaScript não consegue lidar.\n\n<pre><code>\ntypeof Infinity;\n>> \"number\"\n</code></pre>\n\nMas como obter este valor especial Infinity, bom, podemos.\n\n<pre><code>\n1e309;\n>> Infinity\n \n6/0;\n>> Infinity\n</code></pre>\nBom, Infinity representa uma numero extremamente grande, e como representar um numero extremamente pequeno?\n\n<pre><code>\n-1/0\n>> -Infinity\n</code></pre>\nBonito não?\n\nExiste ainda um outro tipo especial, quando estamos lidando com números! O valor NaN! Quem nunca o viu, que atire a primeira pedra \n\nA primeira coisa que eu gosto de deixar claro sobre NaN é que ele é um numero! O que? Ahn? Isso mesmo! Veja..\n\n<pre><code>\ntypeof NaN;\n>> \"number\"\n</code></pre>\n\nOh my God! Provavelmente foi isso que você exclamou ao ver este exemplo! Você obtém o valor NaN quando tenta realizar uma operação que seria realizada sobre  inteiros, mas esta operação falha. Ai você obtém como retorno este tipo especial. Simples não?\n\nVejamos alguns exemplos:\n\n<pre><code>\nvar a = 10 * \"JavaScript\";\na\n>> NaN\n \n1 + 2 + 3 + 4 + NaN;\n>> NaN\n</code></pre>\nPerfeito!\n\n###Strings\n\nComo vocês sabem strings são uma sequencia de caracteres. Em Javascript qualquer valor colocado entre aspas simples OU duplas é uma considerado uma string. Vejamos alguns exemplos:  \n\n<pre><code>\ntypeof \"1\";\n>> \"string\"\n \ntypeof \"texto\";\n>> \"string\"\n \ntypeof 'texto';\n>> \"string\"\n \ntypeof \"\";\n>> \"string\"\n</code></pre>\n\n###Conversões com String\n\nQuando você usa uma string como uma operando em uma operação aritmética (com exceção da adição, veremos o porquê), a string é convertida em um numero por debaixo dos panos.\n\n<pre><code>\nvar s = 3 * '1';\n>> 3\ntypeof s\n>> \"integer\"\n \nvar t = 3 + '1'\n>> \"31\"\ntypeof t\n>> \"string\"\n</code></pre>\n\nComo podemos ver caso o operador seja adição (+) o numero 3 é convertido para string por implicitamente e o resultado é uma string \"31\". Para qualquer outro operador a string seria convertida em um numero como no primeiro exemplo acima.\n\nCaso a conversão implícita falhe o resultado, como não poderia deixar de ser, será NaN.\n\n<pre><code>\n\"texto\" * 3;\n>> NaN\n</code></pre>\n###Boolean\n\nBom como vimos existem apenas dois valores que percentem ao tipo Boolean, true e false;\n\n<pre><code>\nvar b = true;\ntypeof b;\n>> \"boolean\"\n \nvar b = false;\ntypeof b;\n>> \"boolean\"\n</code></pre>\n\nTudo convertido para boolean é true, com exceção dos seguintes 6 valores:\n\n\"\"\nnull\nundefined\n0\nNaN\nfalse\n\n###Undefined\n\nVocê recebe undefined como valor quando você tenta usar uma variável que não existe ou que ainda não foi inicializada\n\n<pre><code>\nfoo\n>> foo is not defined\n \ntypeof foo\n>> \"undefined\"\n \nvar x;\ntypeof x;\n>> \"undefined\"\n \n1 + undefined;\n>> NaN\n \n1 * undefined;\n>> NaN\n \n!!undefined\n>> false\n \n\"\" + undefined\n>> \"undefined\"\n</code></pre>\n\n###Null\nO valor null não é atribuído pelo Javascript pode debaixo dos panos, ele somente pode ter vindo de uma inicialização do seu código\n<pre><code>\nvar variável = null;\n>> null\ntypeof variável\n>> \"object\"\n \nvar i = 1 + null;\n>> 1\n \n1*null;\n>> 0\n</code></pre>\n\nVemos que o valor null é considerado um objeto, o que pode parecer um pouco estranho, ter um objeto que é a representação de nada. Mas veremos mais sobre em futuros posts.\n\nBom por hoje era isso pessoal, espero ter desmistificado um pouco sobre os tipos primitivos no Javascript.\n\nAbraço!\n","ref":"javascript-tipos-primitivos.post.mkdown"}