{"id":"3","title":"Controle de Versão com Git - Parte 2","by":"Rodrigo Vidal","tags":["Git"],"category":"Git","date":"'2011-01-12'","deploy":"true","content":" \t\r\nVamos lá pessoal, na parte 1, falei um pouco sobre os tipos de Sistemas de Controle de Versão. Seguindo..\r\n\r\nBom espero que voce tenha baixado o Msysgit , caso não tenha feito ainda acesse aqui. A instalação é padrão Windows.\r\n\r\nFeito isso teremos o bash do Git instalado que é parte do pacote MSYS, que é uma coleção de utilitários GNU como bash, make gawk e grep que permite utilizar programas e aplicações que dependem de ferramentas Unix para serem utilizadas.\r\n\r\n\r\n\r\n##Sua Identidade\r\n\r\nA primeira coisa a ser fazer é configurar a sua identidade no Git. Isso é importante porque por exemplo, todo Commit que você realizar utilizarão destas informações.\r\n\r\nRode os seguinte comandos no Bash\r\n\r\n<pre>\r\n<code>\r\n$ git config --global user.name Rodrigo Vidal\r\n$ git config --global user.email rodrigovidal777@gmail.com\r\n</code>\r\n</pre>\r\n\r\nApós ter configurado sua identidade, você pode verificar suas configurações globais com o comando\r\n\r\n<pre>\r\n<code>\r\n$ git config --list\r\n</code>\r\n</pre>\r\n\r\n##Conectando o Git ao Github\r\n\r\nO Github é na verdade uma rede social para desenvolvedores, onde é possivel contribuir para projetos opensource, acompanhar seu desenvolvimento e criar novos.\r\n\r\nPara que essa conexão entre o Git e o Github seja possivel você precisar criar uma chave local e informá-la ao Github.\r\n\r\n<pre>\r\n<code>\r\n$ mkdir .ssh\r\n$ cd ~/.ssh\r\n</code>\r\n</pre>\r\n\r\n<pre>\r\n<code>\r\n$ ssh-keygen -t rsa -C email@provedor.com\r\n</code>\r\n</pre>\r\n\r\nLogo aparecerá a seguinte mensagem:\r\n\r\nEnter file in which to save the key (/c/Users/Me/.ssh/id_rsa) \r\n\r\nPressione Enter. Em seguida será solicitado a criação de uma senha.\r\n\r\nAgora abra o arquivo id_rsa.pub gerado (Ex.: C:/Users/rodrigovidal/.ssh) com um editor de texto e copie todo o seu conteudo.\r\n\r\nVá ao GitHub -> Account Settings -> SSH Public Keys.\r\n\r\nClique em Add another public key. Dê um nome para a chavé pública que você criou . Cole o conteúdo do arquivo id_rsa.pub que você copiou no passo anterior no campo key.\r\n\r\nAgora basta salvar.\r\n\r\nPara testar a sua conexão com o GitHub digite no Bash:\r\n<pre>\r\n<code>\r\n$ ssh git@github.com\r\n</code>\r\n</pre>\r\n\r\nSe tudo deu certo você receberá uma mensagem dizendo que você foi autenticado com sucesso!\r\n\r\nEstou gostando muito de trabalhar com o Git em produção, é uma maneira diferente de pensar sobre controle de versão e existem algumas peculiaridades em relação aos outros sistemas. Nos próximos posts vamos falar sobre isso.\r\n\r\nBom pessoal por hoje é só.\r\n\r\nAbraço!\n","ref":"git_part2.post.mkdown"}